{
    "Stage": "1-3",
    "Dialogue": [
            {
                "Narrator": [
                    "The smoke suddenly disappeared. Your vision began seeing the light.",

                    "You looked around and found the place in ruins.",

                    "Corpses of dead goblins laid down the ground—",

                    "And the remains of wreckage scattered around.",

                    "It was a full-blown attack.",

                    "And emerged before you two ladies, each holding a staff.",

                    "They looked at you dumbfounded.",

                    "The latte brown-haired woman spoke first. Her face showed innocence and eyes looking curious at you."
                ]
            },
            
            {
                "Latte brown-haired woman": [
                    "Have you seen those kinds of clothes?"
                ],

                "Narrator": [
                    "The green-haired woman, stern eyes looking at you fiercely, replied to her question." 
                ],

                "Green-haired woman": [
                    "Nope. I haven't seen anyone wearing clothes like that at all."
                ]
            },
            
            {
                "Narrator":[
                    "The latte brown-haired and the green-haired woman continued their brainstorming."
                ],
                "Latte brown-haired woman": ["Perhaps he's from a royal family?"],

                "Green-haired woman": ["Not that either. He lacks the features that would make someone a royalty. Appearance-wise, he is completely average." ]
            },
            
            {
                "Latte brown-haired woman": ["You don't have to say it like that..."],

                "Green-haired woman": ["I mean, his face isn't that attractive..."],

                "Narrator": ["Hearing their words, your heart broke at the utterances of your mediocrity. And bearing with such embarrassment, you finally speak your thoughts."],

                "Me": ["Umm... I'm here, you know?"]
            },

            {
                "Narrator": [
                    "The two women look at you dumbfounded once again.  But the latte brown-haired woman went into shock and covered her face in embarrassment."
                ],

                "Green-haired woman": [
                    "Well, what are you doing here anyways?"
                ],

                "Me": ["Doing here, you say..."]
            },

            {
                "Narrator": ["You couldn't make sense of the, question. It's not like you went here yourself."],

                "Me": [
                    "Well, you see, I suddenly got here",
                    "I was doing my own thing, then, BOOM! I was suddenly surrounded by goblins"
                ]
            },

            {
                "Narrator": [
                    "The green-haired woman sighed and held her forehead on your poor attempt at recalling the events.",
                    "At this point, you are aware how many times she sighed. "],
                "Green-haired woman": ["What kind of explanation is that?"]
            },

            {
                "Narrator": ["Meanwhile, the latte brown-haired woman did something. You saw the pink light glowing from her, after all.",
                "Her hair floated as if the wind blew from her feet. The phenomenon eventually disappeared, and she spoke to the green-haired woman."],

                "Latte brown-haired woman":  ["He was summoned here",
                "I sensed a huge amount of holy magic in the entire camp."],

                "Green-haired woman": ["How could goblins do that? I haven't encountered a goblin shaman in this camp"]
            },

            {
                "Latte brown-haired woman": ["The goblin must have just discovered how to use holy magic recently.", 
                "If I was right on that, he must be their first summonee"],

                "Green-haired woman": ["Summonee? Don't tell me..." ]
            },

            {
                "Latte brown-haired woman": ["I got the same conclusion. He was summoned to be their 'lunch'"],

                "Narrator": ["You were flabbergasted by the latte brown-haired woman's words."],

                "Me": ["W-What do you mean dinner?!"]
            },

            {
                "Narrator": ["The green-haired woman replied to you in a serious voice, different compared to her earlier demeanor."],

                "Green-haired woman": ["There have been rumors that goblins summoned a person and ate them. In conclusion, you were brought here to be their food.,",
                
                "You're a lucky one",
                
                "You are proof that that rumor is true. People before you aren't lucky enough to be evidence. Before, we haven't found any proof of its existence at all"]
            },

            {
                "Narrator": ["You jolted in shock. Your body began shaking at the thought that you were summoned to be a goblins' feast. The fact that they called you \"lucky\" and your existence proved rumors means that people in your situation never made it out."],

                "Me": ["Is this how my isekai journey would start?"]
            },
                
            {
                "Narrator": ["The two women looked at each other in awe once again."],

                "Green-haired woman and Latte brown-haired woman": ["Isekai?"]
            },

            {
                    "Narrator": ["And then, the green-haired woman asked the right question."],

                    "Green-haired woman": ["Anyways, what should we do with him?"],

                    "Latte brown-haired woman": ["Bring him to the Republic, of course.",

                    "We need proof that the rumors are true."]
                    
                    },

            {
                "Green-haired woman": ["Is he enough to be considered evidence?"],

                "Latte brown-haired woman": ["Yup. He doesn't possess mana. He's coated in holy magic from the summoning. He's the best evidence we have here"]
            },

            {"Green-haired woman": ["But how are we going to carry him? We travel by flying, you know?"],

            "Latte brown-haired woman": ["You're right..."]},

            {
                "Narrator": ["Seeing the opportunity, you raised your hand, and the two of them finally paid you attention."],

                "Me": [
                    "Erm... Thanks for saving me, but maybe you guys could just leave me here?"]
                },

            {
                "Narrator": ["The latte brown-haired woman's eyes went stern as she heard your words. Her reaction showed disapproval, and she shouted at you."],

                "Latte brown-haired woman": ["NO!",

                "You're in the Goblin Zone. You're safe with us!"]},

            {
                "Narrator": ["The green-haired woman looked at her with unease."],

                "Green-haired woman": ["Beatrice…"],

                "Latte brown-haired woman": ["You're coming with us, okay?"]
                
                },

            {
                "Green-haired woman": ["Give it up, man. She's not gonna let you go"],

                "": ["You contemplated. You are a stranger to them, as they are to you. Perhaps it stemmed from your upbringing in this world, but you can't help but distrust them."],

            "Me": ["I'm just a stranger, you know? How can I be certain that you two deserve my trust?"]
            
            },

            {
                "": ["The latte brown-haired woman was awed by your words, perhaps she realized your cautiousness.",

                "But, she raised her hand before you, and then she introduced herself."],

                "Latte brown-haired woman":[ "Well, I'm Beatrice, a scavenger. Nice to meet you"],
                
                "Me": ["Erm..."]},

            {
                "": ["The green-haired woman followed suit. Unlike the latte brown-haired \"Beatrice,\" she introduced herself with vigor, while doing a peace sign."],

                "Green-haired woman": ["And I'm Charlotte, nice to meet you as well!"]
            },
                
            {
                "": ["You looked at them in awe. How could they trust me already on our first encounter? What is in their mind. But, you thought that perhaps, it wouldn't be so bad to go with them."],

                "Me": ["It's not like there's a guarantee that I'll be safe on my own here, right?"]},

            {
                
                "": ["Their silence answered you. You continued on your words."],

                "Me": ["Well, I'm...", 
                    "...I'm {{Name}}. Nice to meet the two of you"]
                
            },

            {
                "": ["You took Beatrice's hand, and she pulled you out.",
                    "You stood before them."],

                "Me": ["Looks like I'll leave everything to you, ladies."],

                "Beatrice": ["{{Name}}... thank you, for trust me"]
                
                }
    ]
}